//Исправить название функции на более подходящее для валидации данных логина и пароля
//Соблюдай чистый код, расставь отступы между строк и внутри проверки, везде ставь " ; "
//Пиши стрелочными функциями, обычные используются на проектах реже

function eug(a, b) { //исправь нейминг аргументов
    let c = '' //исправить нейминг переменной
    if (a.length >=2 && a.length <=6 && typeof a === "string" && typeof b === "number" && String(b).length >= 2 && String(b).length <= 6) {
        c = `${a} ${b}`
    } else {
        c = `Логин и пароль должны быть более 2-х символов и менее 6-ти символов, логин-буквы, пароль-цифры`
    }
    return c
}
